## Ejercicios - Vídeo 5

In [1]:
import sqlalchemy
sqlalchemy.create_engine('mysql://scott:tiger@localhost/Curso_SQL')
%load_ext sql
%sql mysql://scott:tiger@localhost/Curso_SQL

1.	Realizar una consulta sobre la tabla “Clientes”  que muestre los campos “Dirección”, “Teléfono” y “Población”. Este último debe aparecer en la consulta con el nombre de “Residencia”. Los registros aparecerán ordenados descendentemente por el campo “Población”.

In [3]:
%%sql

SELECT DIRECCIÓN, TELÉFONO, POBLACIÓN AS RESIDENCIA
FROM CLIENTES
ORDER BY RESIDENCIA DESC

 * mysql://scott:***@localhost/Curso_SQL
38 rows affected.

[('EL COMENDADOR 67', 975694035, 'ZARAGOZA'),
 ('CASTILLA 345', 976388934, 'ZARAGOZA'),
 ('CARMEN 45', 980495288, 'ZAMORA'),
 ('ANTÓN 67', 978564025, 'TERUEL'),
 ('SIERPES 78', 953452567, 'SEVILLA'),
 ('INFANTA MERCEDS 23', 954869234, 'SEVILLA'),
 ('PASEO DEL MAR 45', 942049586, 'SANTANDER'),
 ('CASTELLANOS 205', 923548965, 'SALAMANCA'),
 ('ABEL MARTÍNEZ 67', 921548762, 'SALAMANCA'),
 ('LA PALOMA 123', 985323434, 'OVIEDO'),
 ('OLIVARES 3', 953756259, 'MÁLAGA'),
 ('LAS FUENTES 78', 914456435, 'MADRID'),
 ('ORENSE 7', 918459346, 'MADRID'),
 ('ATOCHA 55', 912495973, 'MADRID'),
 ('AMÉRICA 45', 912649987, 'MADRID'),
 ('ORTEGA Y GASSET 129', 927785235, 'MADRID'),
 ('VALLECAS 34', 913452378, 'MADRID'),
 ('CASTILLA Y LEÓN 34', 915483627, 'MADRID'),
 ('FUENCARRAL 78', 913859234, 'MADRID'),
 ('ORENSE 89', 916872354, 'MADRID'),
 ('GUZMÁN EL BUENO 45', 913299475, 'MADRID'),
 ('VALLECAS 45', 913532785, 'MADRID'),
 ('PASEO DE ÁLAMOS 78', 914354866, 'MADRID'),
 ('AUTONOMÍA 45', 982986944, 'LUGO'),
 ('LA BAÑEZA 67', 987945368, 'LEÓN'),
 ('CORRIDA 345', 985597315, 'GIJÓN'),
 ('LOS MOROS 23', 985754332, 'GIJÓN'),
 ('LAS FUENTES 124', 942347127, 'BILBAO'),
 ('VÍA AUGUSTA 245', 933486984, 'BARCELONA'),
 ('MOTORES 67', 935681245, 'BARCELONA'),
 ('LLOBREGAT 250', 939558365, 'BARCELONA'),
 ('MOTORES 34', 934565343, 'BARCELONA'),
 ('PARIS 123', 933457866, 'BARCELONA'),
 ('LLOBREGAT 345', 934587615, 'BARCELONA'),
 ('DIAGONAL 56', 936692866, 'BARCELONA'),
 ('VIA LAYETANA 245', 936628554, 'BARCELONA'),
 ('JUAN FERNÁNDEZ 89', 920268648, 'ÁVILA'),
 ('GENERAL PERÓN 45', 981345239, 'A CORUÑA')]

2.	Realizar una consulta que muestre que poblaciones hay en la tabla “Clientes”.

In [7]:
%%sql

SELECT POBLACIÓN
FROM CLIENTES
GROUP BY POBLACIÓN

 * mysql://scott:***@localhost/Curso_SQL
16 rows affected.

[('A CORUÑA',),
 ('ÁVILA',),
 ('BARCELONA',),
 ('BILBAO',),
 ('GIJÓN',),
 ('LEÓN',),
 ('LUGO',),
 ('MADRID',),
 ('MÁLAGA',),
 ('OVIEDO',),
 ('SALAMANCA',),
 ('SANTANDER',),
 ('SEVILLA',),
 ('TERUEL',),
 ('ZAMORA',),
 ('ZARAGOZA',)]

3.	Realizar una consulta de agrupación que muestre la media del precio de los artículos de todas las secciones. Mostrar en la consulta los campos sección y suma por sección.

In [11]:
%%sql

SELECT SECCIÓN, SUM(PRECIO) as TOTAL
FROM PRODUCTOS
GROUP BY SECCIÓN

 * mysql://scott:***@localhost/Curso_SQL
6 rows affected.

[('CERÁMICA', Decimal('442.3498')),
 ('CONFECCIÓN', Decimal('501544.2935')),
 ('DEPORTES', Decimal('1305.8123')),
 ('FERRETERÍA', Decimal('95.3806')),
 ('JUGUETERÍA', Decimal('2516.7141')),
 ('OFICINA', Decimal('39.7606'))]

4.	Realizar una consulta de agrupación que muestre la media del precio de todas las secciones menos de juguetería. En la consulta deberán aparecer los campos “Sección” y “Media por sección”.

In [13]:
%%sql

SELECT SECCIÓN, AVG(PRECIO) as PRECIOMEDIO
FROM PRODUCTOS
GROUP BY SECCIÓN
HAVING SECCIÓN <> 'JUGUETERÍA'

 * mysql://scott:***@localhost/Curso_SQL
5 rows affected.

[('CERÁMICA', Decimal('73.72496667')),
 ('CONFECCIÓN', Decimal('55727.14372222')),
 ('DEPORTES', Decimal('130.58123000')),
 ('FERRETERÍA', Decimal('13.62580000')),
 ('OFICINA', Decimal('39.76060000'))]

5.	Realizar una consulta que muestre cuantos artículos hay de la sección “Deportes”.

In [18]:
%%sql

SELECT SECCIÓN, COUNT(CÓDIGOARTÍCULO) as CANTIDADTOTAL
FROM PRODUCTOS
GROUP BY SECCIÓN
HAVING SECCIÓN = 'Deportes'

 * mysql://scott:***@localhost/Curso_SQL
1 rows affected.

[('DEPORTES', 10)]